## Titanic Assignment

In [1]:
import pandas as pd

In [2]:
train=pd.read_csv("/Users/sudhanshukumar/Documents/Machine Learning/0 Assignment/Titanic/train.csv")
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [4]:
train.groupby("Survived").mean()

          PassengerId    Pclass        Age     SibSp     Parch       Fare
Survived
0          447.016393  2.531876  30.626179  0.553734  0.329690  22.117887
1          444.368421  1.950292  28.343690  0.473684  0.464912  48.395408

In [5]:
test=pd.read_csv("/Users/sudhanshukumar/Documents/Machine Learning/0 Assignment/Titanic/test.csv")
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [6]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [7]:
df=pd.concat([train.drop("Survived",axis=1),test])

In [8]:
df.to_csv("Titanic.csv")

In [9]:
train.drop(["Name","PassengerId","Ticket","Cabin"],axis=1,inplace=True)

In [10]:
train.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [11]:
sex=pd.get_dummies(train.Sex)
sex.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [12]:
train[["sex"]]=sex.drop("female",axis=1)

In [13]:
train.drop("Sex",axis=1,inplace=True)

In [14]:
len(train)

891

In [15]:
em=pd.get_dummies(train.Embarked)
len(em)

891

In [16]:
em.head()

   C  Q  S
0  0  0  1
1  1  0  0
2  0  0  1
3  0  0  1
4  0  0  1

In [17]:
train["C"]=em.C

In [18]:
train["Q"]=em.Q

In [19]:
train.head()

   Survived  Pclass   Age  SibSp  Parch     Fare Embarked  sex  C  Q
0         0       3  22.0      1      0   7.2500        S    1  0  0
1         1       1  38.0      1      0  71.2833        C    0  1  0
2         1       3  26.0      0      0   7.9250        S    0  0  0
3         1       1  35.0      1      0  53.1000        S    0  0  0
4         0       3  35.0      0      0   8.0500        S    1  0  0

In [20]:
train.drop("Embarked",axis=1,inplace=True)

In [21]:
age_mean=train.Age.mean()

In [22]:
train.fillna(age_mean,inplace=True)

In [23]:
train.isnull().sum()

Survived    0
Pclass      0
Age         0
SibSp       0
Parch       0
Fare        0
sex         0
C           0
Q           0
dtype: int64

In [24]:
X=train.drop("Survived",axis=1)
y=train.Survived

In [25]:
from sklearn.model_selection import train_test_split

In [26]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2)

In [30]:
from sklearn.model_selection import cross_val_score

In [31]:
cross_val_score(LogisticRegression(max_iter=1000),X,y)

array([0.78212291, 0.78651685, 0.78651685, 0.76966292, 0.8258427 ])

In [32]:
from sklearn.linear_model import LinearRegression
from sklearn.tree import DecisionTreeClassifier
from sklearn.tree import DecisionTreeRegressor
from sklearn.ensemble import RandomForestClassifier
from sklearn.ensemble import RandomForestRegressor
from sklearn.svm import SVC
from sklearn.svm import SVR
from sklearn.naive_bayes import GaussianNB
from sklearn.naive_bayes import BernoulliNB
from sklearn.naive_bayes import MultinomialNB

In [33]:
cross_val_score(LinearRegression(),X,y)

array([0.33408577, 0.37135248, 0.38279606, 0.31029749, 0.45173582])

In [34]:
cross_val_score(DecisionTreeClassifier(),X,y)

array([0.75977654, 0.75842697, 0.79775281, 0.76966292, 0.81460674])

In [35]:
cross_val_score(DecisionTreeRegressor(),X,y)

array([-0.14504691,  0.10879408,  0.14935163,  0.06077021,  0.07696879])

In [36]:
cross_val_score(RandomForestClassifier(),X,y)    # 1st

array([0.79888268, 0.80337079, 0.85955056, 0.76966292, 0.82022472])

In [37]:
cross_val_score(RandomForestRegressor(),X,y)

array([0.23458567, 0.35376335, 0.49558545, 0.33341206, 0.48043688])

In [38]:
cross_val_score(SVC(),X,y)

array([0.58659218, 0.71348315, 0.69101124, 0.68539326, 0.69101124])

In [39]:
cross_val_score(SVR(),X,y)

array([-0.23769338,  0.01068043, -0.01653821,  0.00339342,  0.17108781])

In [40]:
cross_val_score(BernoulliNB(),X,y)   # 2nd

array([0.81005587, 0.79775281, 0.78089888, 0.75280899, 0.78651685])

In [41]:
cross_val_score(GaussianNB(),X,y)

array([0.7150838 , 0.76966292, 0.78651685, 0.79213483, 0.81460674])

In [42]:
cross_val_score(MultinomialNB(),X,y)

array([0.59217877, 0.71348315, 0.70224719, 0.73033708, 0.71348315])

In [43]:
## So from the above results we find conclude that RandomForestClassifier performs the Best

In [44]:
rf=RandomForestClassifier(n_estimators=1500)
rf.fit(X,y)
rf.score(X_train,y_train)

0.9817415730337079

In [45]:
# predicting the value for test

In [46]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [74]:
test.drop(["PassengerId","Name","Cabin","Ticket"],axis=1,inplace=True)

In [76]:
mean_age=test.Age.mean()

In [81]:
test.fillna(mean_age,inplace=True)

In [83]:
test.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [87]:
sex=pd.get_dummies(test.Sex)
sex.drop("female",axis=True, inplace=True)

In [91]:
test["sex"]=sex

In [94]:
test.drop("Sex",axis=1,inplace=True)

In [95]:
em=pd.get_dummies(test.Embarked)

In [98]:
em.drop("S",axis=1,inplace=True)

In [100]:
test["C"]=em.C

In [102]:
test["Q"]=em.Q

In [111]:
test.drop("Embarked",axis=1,inplace=True)

In [113]:
test.head()

   Pclass   Age  SibSp  Parch     Fare  sex  C  Q
0       3  34.5      0      0   7.8292    1  0  1
1       3  47.0      1      0   7.0000    0  0  0
2       2  62.0      0      0   9.6875    1  0  1
3       3  27.0      0      0   8.6625    1  0  0
4       3  22.0      1      1  12.2875    0  0  0

In [114]:
#using RandomForestClassifier

rf.predict(test)

array([0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1,
       1, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1,
       1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0,
       0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1,
       0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1,
       1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0,
       0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0,
       1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1,
       0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1,
       0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0,
       1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0,
       0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1])

In [115]:
predicted=rf.predict(test)

In [117]:
len(predicted)

418

In [120]:
df=pd.read_csv("test.csv")

In [126]:
df.drop(["Pclass","Name","Sex","Age","SibSp","Parch","Ticket","Fare","Cabin","Embarked"],axis=1,inplace=True)

In [127]:
df["Survived"]=predicted

In [131]:
df.to_csv("predictions.csv")

In [ ]:
from sklearn.model_selection import X